Rewrite dot to mermaid for native github rendering
